In [1]:
import pandas as pd
dados = pd.read_csv("C:/Users/RG944SA/Desktop/curso-AnaliseDados/athlete_events.csv")

In [2]:
dados.head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN

In [4]:
dados.rename(columns={'Name':'Nome','Sex':'Sexo','Age':'Idade'},inplace=True) #alterando nome das colunas
#inplace=True ele altera o valor e nao mostra o resultado

In [5]:
altura = dados['Height']

In [6]:
type(altura) #dataframe de uma unica coluna

pandas.core.series.Series

In [7]:
dados['Medal'].value_counts() #vai contabilizar os valores

Gold      13372
Bronze    13295
Silver    13116
Name: Medal, dtype: int64

In [8]:
dados.describe()

,ID,Idade,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [9]:
dados.drop('ID', axis=1,inplace=True) # exluindo uma coluna
dados.drop('Season', axis=1,inplace=True) # axis=1 siginifica que Ã© a coluna

In [10]:
dados.head(1)

,Nome,Sexo,Idade,Height,Weight,Team,NOC,Games,Year,City,Sport,Event,Medal
0,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Barcelona,Basketball,Basketball Men's Basketball,NaN